app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Health"], ["updated_at", 2017-03-09 15:05:28 UTC], ["id", 6]]
---
  def update
    @category = Category.find(params[:id])

    if @category.update_attributes(category_params)