app/controllers/post_comments_controller.rb

    def set_post_comment
      @post_comment = PostComment.find(params[:id])
---
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]