app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @post = Post.new
    @category = Category.all

INSERT INTO "posts" ("title", "body", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Adding new Post"], ["body", "belongs_to :category"], ["category_id", 4], ["created_at", 2017-03-04 19:42:00 UTC], ["updated_at", 2017-03-04 19:42:00 UTC]]
---
  def create
     @post = Post.new(post_params)
     if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "\r\nThe Ruby on Rails Tutorial by Michael Hart \r\nThe Ruby on Rails Tutorial by Michael Hart"], ["updated_at", 2017-03-04 19:45:09 UTC], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)