app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def home
  	@posts = Post.all