app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Coola"], ["updated_at", 2017-01-21 05:45:30 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)